InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/омг_ОткрытыеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_ОткрытыеДокументы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоСеанса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/СоглашенияСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СоглашенияСтрахования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ВидДоговораНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.омг_ВидДоговораНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омг_ДополнительныеАлгоритмы/Ext/Module.bsl
Функция ПолучитьЗначениеПараметраМедкарты(Док, КодПараметра, ИмяПараметра) Экспорт
	
	ЗаполняемыеПараметры = Док.МедицинскаяКарта.ЗаполняемыеПараметры;
	
	НужноеЗначение = "";
	Для каждого СтрокаПараметра Из ЗаполняемыеПараметры Цикл
		Если СтрокаПараметра.ИмяПараметра.Код = КодПараметра Тогда
			НужноеЗначение = СтрокаПараметра.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(НужноеЗначение) Тогда
		ДанныеПараметров = МедицинскаяДеятельность.ПолучитьВычисляемыеЗначенияПараметровМедкарты(Док.МедицинскаяКарта, 
		Док.МедицинскаяКарта.ВидКарты, Док.МедицинскаяКарта.ЗаполняемыеПараметры);
		
		
		НужноеЗначение = "";
		Для каждого СтрокаПараметра Из ДанныеПараметров.Параметры Цикл
			Если СтрокаПараметра.Ключ = ИмяПараметра Тогда
				Если ЗначениеЗаполнено(СтрокаПараметра.Значение.ВычисленноеЗначение) Тогда
					НужноеЗначение = СтрокаПараметра.Значение.ВычисленноеЗначение.Значение;
				Иначе
					НужноеЗначение = "";
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
	
	Результат = НужноеЗначение; 
	
КонецФункции

Функция ВернутьСписокУслугСприоритетом(ГруппаСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&ИсходнаяГруппа)
	|ИТОГИ ПО
	|	Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("ИсходнаяГруппа", ГруппаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией); 
	ТабВозврата = Новый ТаблицаЗначений; 
	ТабВозврата.Колонки.Добавить("Услуга",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТабВозврата.Колонки.Добавить("Приоритет",Новый ОписаниеТипов("Число")); 
	ТабВозврата.Колонки.Добавить("ИсходнаяУслугаГруппа",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВыдатьВсеВложения(ВыборкаСсылка,ТабВозврата,ГруппаСсылка.Уровень());
	
	Возврат ТабВозврата;
	
КонецФункции	

Процедура ВыдатьВсеВложения(ИерархическаяВыборка,ТабВозврата,ИсхУровень)
	
	Пока ИерархическаяВыборка.Следующий() Цикл
		
		СпособВыборки = ОбходРезультатаЗапроса.ПоГруппировкамСИерархией;
		
		Если ИерархическаяВыборка.ТипЗаписи() = ТипЗаписиЗапроса.ДетальнаяЗапись и ИерархическаяВыборка.Ссылка.ЭтоГруппа = Ложь Тогда
			СтрТабВозврата = ТабВозврата.Добавить();
			СтрТабВозврата.Услуга = ИерархическаяВыборка.Ссылка;
			СтрТабВозврата.Приоритет = ИерархическаяВыборка.Уровень()-ИсхУровень;
		КонецЕсли;	
		Если ИерархическаяВыборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии Тогда
			
			ДочерняяВыборка = ИерархическаяВыборка.Выбрать(СпособВыборки, ИерархическаяВыборка.Группировка());
			
		Иначе
			
			ДочерняяВыборка = ИерархическаяВыборка.Выбрать(СпособВыборки);
			
		КонецЕсли;
		
		ВыдатьВсеВложения(ДочерняяВыборка,ТабВозврата,ИсхУровень);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВернутьОказанияУслугПоЗаявке(Заявка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОказаниеУслугЗаявки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОказаниеУслуг.Заявки КАК ОказаниеУслугЗаявки
		|ГДЕ
		|	ОказаниеУслугЗаявки.Заявка.Ссылка = &Заявка
		|
		|СГРУППИРОВАТЬ ПО
		|	ОказаниеУслугЗаявки.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОказаниеУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОказаниеУслуг КАК ОказаниеУслуг
		|ГДЕ
		|	ОказаниеУслуг.Ссылка.ДокументОснование.Ссылка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВозМассив = РезультатЗапроса[0].Выгрузить(); 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		 ЗаполнитьЗначенияСвойств(ВозМассив.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;	
	
	ВозМассив.Свернуть("Ссылка");
	ВозМассив = ВозМассив.ВыгрузитьКолонку("Ссылка");
		 
	Возврат ВозМассив;
	
КонецФункции	

Функция ПолучитьОрганизациюСотрудника() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗначениеНастроек.Значение КАК Значение
	             |ИЗ
	             |	ПланВидовХарактеристик.НастройкиПользователей КАК Настройки
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПользователей КАК ЗначениеНастроек
	             |		ПО (ЗначениеНастроек.Настройка = Настройки.Ссылка)
	             |			И (ЗначениеНастроек.Пользователь = &Пользователь)
	             |ГДЕ
	             |	НЕ Настройки.ПометкаУдаления
	             |	И Настройки.Ссылка = &омг_ОсновнаяОрганизация
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Настройки.ЭтоГруппа ИЕРАРХИЯ,
	             |	Настройки.Наименование";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("омг_ОсновнаяОрганизация",ПланыВидовХарактеристик.НастройкиПользователей.омг_ОсновнаяОрганизация);
    Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Значение;

КонецФункции   

Функция ПолучитьКлиникуСотрудника() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗначениеНастроек.Значение КАК Значение
	             |ИЗ
	             |	ПланВидовХарактеристик.НастройкиПользователей КАК Настройки
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПользователей КАК ЗначениеНастроек
	             |		ПО (ЗначениеНастроек.Настройка = Настройки.Ссылка)
	             |			И (ЗначениеНастроек.Пользователь = &Пользователь)
	             |ГДЕ
	             |	НЕ Настройки.ПометкаУдаления
	             |	И Настройки.Ссылка = &омг_ОсновнаяОрганизация
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Настройки.ЭтоГруппа ИЕРАРХИЯ,
	             |	Настройки.Наименование";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("омг_ОсновнаяОрганизация",ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойФилиал);
    Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Значение;

КонецФункции

Функция ВернутьАктуальностьСоглашения(Соглашение,ДатаПроверки) Экспорт
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоглашенияСтрахования.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Справочник.СоглашенияСтрахования КАК СоглашенияСтрахования
		|ГДЕ
		|	СоглашенияСтрахования.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Соглашение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		
		Если ВыборкаДетальныеЗаписи.ДатаОкончания >= ДатаПроверки Тогда
			 Возврат Истина
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция омг_ВернутьОрганизациюПоФилиалу(Филиал) Экспорт
	
	
	Возврат Филиал.Организация 


КонецФункции

Функция ПроверкаВозвратовОказанийУслуг(ДокументОснование = Неопределено,ДокументВозврат = Неопределено, ЭтоПроведение = Ложь,ВозвратИсключение = Неопределено, СуммаВозвратаТек = 0) Экспорт
	
	Если ДокументОснование = Неопределено Тогда 
		
		ДокументОснование = ДокументВозврат.ДокументОснование 
		
	КонецЕсли; 
	
	Если ВозвратИсключение = Неопределено Тогда 
		
		ВозвратИсключение = Документы.ОказаниеУслуг.ПустаяСсылка() 
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(ОказаниеУслугРаботы.Ссылка.СуммаДокумента, 0)) КАК СуммаДокумента
	|ИЗ
	|	Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
	|ГДЕ
	|	ОказаниеУслугРаботы.Ссылка = &Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(ОказаниеУслугРаботы.Ссылка.СуммаДокумента, 0)) КАК СуммаДокумента
	|ИЗ
	|	Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
	|ГДЕ
	|	ОказаниеУслугРаботы.Ссылка.ДокументОснование = &Основание
	|	И ОказаниеУслугРаботы.Ссылка.Проведен
	|	И ОказаниеУслугРаботы.Ссылка <> &ВозвратИсключение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОказаниеУслугРаботы.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ОказаниеУслугРаботы.Количество, 0) КАК Количество,
	|	СУММА(ЕСТЬNULL(ОказаниеУслугРаботы1.Количество, 0)) КАК Количество1
	|ИЗ
	|	Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы1
	|		ПО ОказаниеУслугРаботы.Ссылка = ОказаниеУслугРаботы1.Ссылка.ДокументОснование
	|			И ОказаниеУслугРаботы.Номенклатура = ОказаниеУслугРаботы1.Номенклатура
	|ГДЕ
	|	ОказаниеУслугРаботы.Ссылка = &Основание
	|	И ОказаниеУслугРаботы1.Ссылка.Проведен
	|	И ОказаниеУслугРаботы1.Ссылка <> &ВозвратИсключение
	|
	|СГРУППИРОВАТЬ ПО
	|	ОказаниеУслугРаботы.Номенклатура,
	|	ЕСТЬNULL(ОказаниеУслугРаботы.Количество, 0)";
	
	Запрос.УстановитьПараметр("Основание", ДокументОснование);
	Запрос.УстановитьПараметр("ВозвратИсключение",ВозвратИсключение);                                       
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ОснованиеСумма = РезультатЗапроса[0].Выбрать();
	ОснованиеСумма.Следующий();
	ОснованиеСумма = ОснованиеСумма.СуммаДокумента;
	
	ВозвратыСумма = РезультатЗапроса[1].Выбрать();
	
	ВозвратыСумма.Следующий();
	ВозвратыСумма = ?(ВозвратыСумма.СуммаДокумента = NULL,0,ВозвратыСумма.СуммаДокумента);
		
	ВозвратыСумма = ВозвратыСумма + СуммаВозвратаТек;
	
	Если ВозвратыСумма > ОснованиеСумма Тогда 
		Возврат "По документу " + ДокументОснование + " превышение суммы возврата!";
	КонецЕсли; 
	
	ВыборкаНоменклатура = РезультатЗапроса[2].Выбрать();
	
	Если ЭтоПроведение Тогда
		ВозЗначение = Новый ТаблицаЗначений;
		ВозЗначение.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ВозЗначение.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	иначе
		ВозЗначение = "По документу " + ДокументОснование + " были возвращены все услуги!";
	КонецЕсли;
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.Количество1 Тогда
			Если ЭтоПроведение Тогда
				НоваяСтрока = ВозЗначение.Добавить();
				НоваяСтрока.Номенклатура = ВыборкаНоменклатура.Номенклатура;
				НоваяСтрока.Количество = ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.Количество1;
			иначе
				ВозЗначение = "";
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;     
	
	Возврат ВозЗначение;

КонецФункции	

&НаСервере
Функция ПолучитьСписокПросматривающих(СсылкаНаДокумент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВозЗначение = "";
	
	МассивСеансов = ПолучитьСеансыИнформационнойБазы();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОткрытыеДокументы.Пользователь.Наименование КАК Пользователь,
	|	ОткрытыеДокументы.ДатаОткрытия КАК ДатаОткрытия,
	|	ОткрытыеДокументы.Пользователь КАК ПользовательСсылка,
	|	ОткрытыеДокументы.НачалоСеанса КАК НачалоСеанса,
	|	ОткрытыеДокументы.НомерСеанса КАК НомерСеанса,
	|	ОткрытыеДокументы.УникальныйИдентификаторПользователяИБ КАК УникальныйИдентификаторПользователяИБ
	|ИЗ
	|	РегистрСведений.омг_ОткрытыеДокументы КАК ОткрытыеДокументы
	|ГДЕ
	|	ОткрытыеДокументы.Документ = &СсылкаНаДокумент";
	
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НайденСеанс = Ложь;	
		Для Каждого Сеанс Из МассивСеансов Цикл
			Если Сеанс.НомерСеанса = ВыборкаДетальныеЗаписи.НомерСеанса 
				и Сеанс.НачалоСеанса = ВыборкаДетальныеЗаписи.НачалоСеанса 
				и Строка(Сеанс.Пользователь.УникальныйИдентификатор) = ВыборкаДетальныеЗаписи.УникальныйИдентификаторПользователяИБ Тогда
				ВозЗначение = ВозЗначение + ВыборкаДетальныеЗаписи.Пользователь + ". Дата/время открытия: "+  ВыборкаДетальныеЗаписи.ДатаОткрытия+"; " + Символы.ПС;
				НайденСеанс = Истина;
				прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если не НайденСеанс Тогда
			
			МенеджерЗаписи = РегистрыСведений.омг_ОткрытыеДокументы.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Документ     = СсылкаНаДокумент;
			МенеджерЗаписи.Пользователь = ВыборкаДетальныеЗаписи.ПользовательСсылка; 
			МенеджерЗаписи.НачалоСеанса = ВыборкаДетальныеЗаписи.НачалоСеанса;
			МенеджерЗаписи.НомерСеанса = ВыборкаДетальныеЗаписи.НомерСеанса;
			МенеджерЗаписи.УникальныйИдентификаторПользователяИБ = ВыборкаДетальныеЗаписи.УникальныйИдентификаторПользователяИБ;
			МенеджерЗаписи.Удалить();
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ВозЗначение;
	

КонецФункции     

&НаСервере
Функция ДатаНачалаСеанса(НомерСеанса) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивСеансов = ПолучитьСеансыИнформационнойБазы();
	
	Для Каждого Сеанс Из МассивСеансов Цикл
		Если Сеанс.НомерСеанса = НомерСеанса Тогда
			Возврат Сеанс.НачалоСеанса;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Дата('00010101');
	
КонецФункции
